# 1) შექმენით tuple, საიდანაც დაპრინტავთ პირველ ორ ელემენტს

name=('luka','gio','merabi','miqa')
print(name[0],name[1])

# 2) numbers = (2, 56, 99, 22, 15, 23, 66, 11, 134, 23, 66, 91, 22, 2, 23)
#    numbers tuple-ში დაპრინტეთ რამდენჯერ მეორდება ციფრი 23 count-ის გამოყენებით

numbers = (2, 56, 99, 22, 15, 23, 66, 11, 134, 23, 66, 91, 22, 2, 23)
print(numbers.count(23)) 

# 3) aura = (10, 25, 5, 80, 70, 20) 

#    aura tuple-დან for loop-ის გამოყენებით დაბეჭდეთ მხოლოდ 10-ზე დიდი რიცხვები

aura = (10, 25, 5, 80, 70, 20)
for i in aura:
    if i > 10:
        print(i)



# 4) კომენტარის სახით ახსენით, რა განსხვავებაა list-სა და tuple-ს შორის
#  List არის mutable  მონაცემთა ტიპი რაც ნიშნავს რომ ერთხელ შექმნის შემდეგ ელემენტების შეცვლა შეუძლებელია.
#  List შეიძლება შეიცავდეს ნებისმიერი რაოდენობის ელემენტებს და მისი ზომა შეიძლება შეიცვალოს.
#  Tuple-ის ზომა კი უცვლელია, მასში უკვე არსებული ელემენტების შეცვლა ან დამატება შეუძლებელია.

# 5) კომენტარის სახით ახსენით, რას ნიშნავს immutable და mutable
# Mutable ტიპი ნიშნავს რომ მისი მნიშვნელობები შეიძლება შეიცვალოს მას შემდეგ, რაც მას შექმნით
# მაგალითად list არის mutable რადგან მასში შეგვიძლია დავამატოთ ახალი ელემენტები ამოვიღოთ არსებული ან შევცვალოთ მათი მნიშვნელობა
# 1. list





# Immutable ტიპი ნიშნავს, რომ მასში შენახული მნიშვნელობები არ შეიძლება შეიცვალოს მას შემდეგ, რაც მას შექმნით.
# მაგალითად, tuple არის immutable, რადგან როდესაც მას შექმნით, ვერ შეცვლით მის ელემენტებს.
# 1. tuple
# 2. str (string)
# 3. int

