
//1) ახსენით რისთვის გამოიყენება useState
//useState გამოიყენება ფუნქციურ კომპონენტში მდგომარეობის  შესანახად

//2) Jsx სადა და js შორის რა განსხვავებაა ახსენით კომენატრებით.
//JS  არის ჩვეულებრივი პროგრამირების ლოგიკა
//JSX არის HTML-ის მსგავსი სინტაქსი რომელიც JS-ში გარდაიქმნება

//3) რას ნიშნავს Jsx ახსენი კომენტარებით
//JSX არის JavaScript-ის გაფართოება რომელიც გაძლევს საშუალებას HTML-ის მსგავსი კოდი გამოიყენო React-ში.

//4) რა არის Hook-ი?
//Hook არის სპეციალური ფუნქცია React-შირომელიც გაძლევს საშუალებას ფუნქციურ კომპონენტებში გამოიყენო ისეთი შესაძლებლობები რაც ადრე მხოლოდ კლასებში შეიძლებოდა

//5) გადახდეთ რესურსებს, და ეცადეთ გაიაზროთ:
//https://www.w3schools.com/react/react_usestate.asp
//https://www.w3schools.com/react/react_hooks.asp