#დავალება 1
#შექმენით სია list_of_names, რომელშიც ინახება სახელები. დაწერეთ კოდი, რომელიც ითვლის, რამდენჯერ მეორდება კონკრეტული სახელი (მაგალითად, "დავით") სიაში.

List_of_names=["luka","daviti","giorgi","daviti","lasha"]
print(List_of_names.count("daviti"))

#დავალება 2:
#შექმენით სია, რომელშიც ინახება რიცხვები. დაწერეთ კოდი, რომელიც ამ სიის რიცხვებს გადაატრიალებს უკუღმა reverse მეთოდის გამოყენებით და 
#დაბეჭდეთ შედეგი..

num_arr=[2,3,6,7,8,9,4,5,6,7,8,9]
num_arr.reverse()
print(num_arr)

#დავალება 3:
#შექმენით სია list_of_numbers, დაამატეთ მასში რამდენიმე რიცხვი და დაწერეთ კოდი, რომელიც ამ რიცხვებს სიის სიგრძის მიხედვით მრავალჯერ გამოიტანს  იგიევე ციფრებს.
#მაგალითად, თუ სიის სიგრძე არის 3 და სია ასეთია: [1, 2, 3], საბოლოოდ უნდა მივიღოთ: [1, 2, 3, 1, 2, 3, 1, 2, 3].

List_of_numbers=[1,2,3,4,5]
result=List_of_numbers* len(List_of_numbers)
print(result)


#დავალება 4
#შექმენით პროგრამიერების ენის სია insert_arr. შემდეგ დაამატეთ კონკრეტული ელემენტი (მაგალითად, "დავითი") კონკრეტულ ინდექსზე insert მეთოდის გამოყენებით. დაბეჭდეთ განახლებული სია.
 
insert_arr=[]

insert_arr.insert(0,"luka chad")
insert_arr.insert(1,"daviti")
insert_arr.insert(2,"lasha")

print(insert_arr)


#დავალება 5
#შექმენით სია, იპოვეთ კონკრეტული ელემენტის რაოდენობა count მეთოდის გამოყენებით და ამოიღეთ ეს ელემენტი სიიდან remove მეთოდით. დაბეჭდეთ ელემენტის რაოდენობა და განახლებული სია.
# შექმნათ სია
lst = [1, 2, 3, 4, 2, 5, 2]

count_2 = lst.count(2)


lst.remove(2)

print(lst)

